public class Task3 {
    /**
     * Задание №3
     *
     * 1. Реализовать базовые операции калькулятора (+,-,/,*) для предыдущего задания (Задание выполнено сразу в Task2)
     *
     * 2. Поиск максимального элемента в массиве. Для начала задать массив слов.Размерность массива произвольна,
     * задается в консоли. После чего в консоли вводятся слова в количестве равном заданной длине массива. В полученном
     * массиве необходимо найти самое длинное слово. Результат вывести на консоль
     *
     * 3. Программа должна выполнять одно из заданий на выбор. Если в консоли ввести 1 - запуститься выполнение
     * калькулятора, если 2 - поиск максимального слова в массиве.
     */
    public static void main(String[] args) {
// Уже завтра сделаю лучше...
    }
}
